#### BuiltInFailures.ComponentRepeaterSlotFailures Members

---

|  |
| --- |
| BuiltInFailures ComponentRepeaterSlotFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures ComponentRepeaterSlotFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | ComponentRepeaterSlot\_InvalidFamilyOnReload | Reloaded family not appropriate for repeated component. |

# See Also

BuiltInFailures ComponentRepeaterSlotFailures Class

Autodesk.Revit.DB Namespace